{
     "intents": [
    {
      "tag": "greetings",
      "patterns": ["Hello", "Hi", "Hey there", "Greetings", "Howdy","hello   "],
      "responses": [
        "Hello! How may I assist you today?",
        "Hi there! What brings you here?",
        "Greetings! How can I help you?"
      ]
    },
    {
      "tag": "farewell",
      "patterns": ["Goodbye", "See you later", "Bye", "Take care"],
      "responses": [
        "Goodbye! If you have more questions, feel free to return.",
        "See you later! Have a wonderful day.",
        "Bye! Come back anytime you need assistance."
      ]
    },
    {
        "tag": "gratitude",
        "patterns": ["Thanks", "Thank you", "Appreciate it", "Thanks a lot"],
        "responses": [
          "You're welcome! If you need further help, don't hesitate to ask.",
          "Glad I could assist! If you have more questions, feel free to reach out.",
          "My pleasure! Let me know if there's anything else I can do for you."
        ]
      },
      {
        "tag": "programs_info",
        "patterns" :[
          "What are the major courses offered at SASTRA College?",
          "Can you provide information about the different academic programs available at SASTRA College?",
          "Tell me about the undergraduate courses offered by SASTRA College.",
          "What postgraduate programs does SASTRA College offer?",
          "Are there any specialized courses or streams available at SASTRA College?",
          "I'm interested in learning more about the courses in the science department at SASTRA College.",
          "Could you give me details about the professional courses provided by SASTRA College?",
          "What are the options for management courses at SASTRA College?",
          "Can you provide information on SASTRA College's engineering programs?",
          "I'm looking for details on the arts and humanities courses offered at SASTRA College."
      ],
        "responses": [
          "  sastra offers various programs including B.Tech, M.Tech, M.Sc., M.C.A., M.B.A., and more. For specific details, you can visit the official website or inquire for more information."
        ]
      },
      {
        "tag": "admissions_info",
        "patterns": ["How can I apply for admission to SASTRA College?",
        "Tell me about the admission process at SASTRA College.",
        "What are the eligibility criteria for admission to SASTRA College?",
        "Can you provide details on the documents required for admission?",
        "Are there any entrance exams for admission to SASTRA College?",
        "I'm interested in B.Tech admissions. What is the procedure?",
        "What is the deadline for submitting the admission application?",
        "Can I apply online for admission to SASTRA College?",
        "Tell me about the selection criteria for admissions.",
        "Are there any special provisions for NRI admissions at SASTRA College?"],
        "responses": [
          "Admissions to B.Tech. and 5-Year Integrated M.Tech. programs are based on JEE-Main and Class XII scores. There are specific streams for admission. For more details, visit the official admission page on the website."
        ]
      },
      {
        "tag": "application_process",
        "patterns": ["Do I need a separate application for Stream 1 and Stream 2 ?", "Application submission details based on streams","Application submission details based on stream"],
        "responses": [
          "No, you don't need separate applications for Stream 1 and Stream 2. Use the same application form and provide relevant details for both streams."
        ]
      },
      {
        "tag": "stream_info",
        "patterns": [" Stream 1 and Stream 2?", "Clarify streams", "Role of JEE mains and board marks","streams","stream 1 and stream 2","jee mains  admission"],
        "responses": [
          "Stream 1 considers both JEE-Main and Class XII scores, while Stream 2 is solely based on normalized aggregate Class XII score. Both streams have distinct criteria for admission."
        ]
      },
      {
        "tag": "eligibility_info",
        "patterns" : [
          "What are the eligibility criteria for admission to SASTRA College?",
          "Can you provide information on eligibility requirements for SASTRA College?",
          "What qualifications are needed for applying to SASTRA College?",
          "Are there specific subject requirements for admission?",
          "Tell me about the eligibility criteria for B.Tech admissions at SASTRA College.",
          "What is the minimum percentage required for admission?",
          "Do you consider extracurricular activities in the eligibility criteria?",
          "Can you explain the eligibility criteria for international students?",
          "Are there any age restrictions for admission to SASTRA College?",
          "What documents are required to prove eligibility for admission?"
      ],
      "responses": [
          "Eligibility criteria vary for different programs. For B.Tech, a pass in +2 with specified subjects and a minimum aggregate of 60% is required. Different programs have different eligibility criteria. Visit the official website for details."
        ]
      },
      {
        "tag": "nri_admissions",
        "patterns": ["Alternate methods for B.Tech. admissions?", "What are the provisions for NRI admissions at SASTRA College?",
        "Can you provide details on the NRI admissions process?",
        "Are there any special requirements for NRI students applying to SASTRA College?",
        "How does the admission process differ for NRI candidates?",
        "Tell me about the documents needed for NRI admissions at SASTRA College.",
        "Is there a separate quota for NRI admissions?",
        "What is the eligibility criteria for NRI candidates?",
        "Can NRI students apply for scholarships or financial aid?",
        "Are there specific admission tests for NRI applicants?",
        "Do NRI students need to appear for entrance exams for admission?", "NRI admissions details", "Process for NRI seats","NRI admissions","NRI seat","nri appliactions","about nri"],
        "responses": [
          "Admissions are based on merit for both Stream 1 and Stream 2. NRI admissions are available with provisions. Interested students should contact the Office of Admissions for detailed information."
        ]
      },
      {
        "tag": "pg_programs_info",
        "patterns":[
          "How are admissions to M.Tech., M.B.A., and M.C.A. conducted at SASTRA College?",
          "Tell me about the admission process for postgraduate programs at SASTRA College.",
          "What are the eligibility criteria for M.Tech., M.B.A., and M.C.A. admissions?",
          "Can you provide details on the documents required for postgraduate admissions?",
          "Are there any specific entrance exams for M.Tech., M.B.A., and M.C.A. admissions?"
      ],
        "responses": [
          "Rolling admissions to these programs are based on qualifying degree/board marks and competitive exam scores such as CAT, XAT, AIMAT, CMAT, AIMCAT for MBA and GATE for M.Tech."
        ]
      },
      {
        "tag": "admission_mode",
        "patterns": ["Is the application process for SASTRA College online or offline?",
        "Can I submit my application to SASTRA College online?",
        "Tell me about the mode of application for admission to SASTRA College.",
        "Are there any offline application options available for admission?",
        "What is the preferred mode of application at SASTRA College?",
        "Do I need to visit the campus for the application process?",
        "Are there any application fees, and how can I pay them?",
        "Can I track the status of my application online?",
        "Is there a specific portal for submitting online applications?",
        "Are there any advantages to applying online for admission?","application process online or offline?", "Details of the application process","online appliaction","offline application","mode of application","method of application","online or offline admissions","online admissions","offline admissions"],
        "responses": [
          "The entire admission process, including application, admission, tuition fee payment, enrollment, and withdrawal, is conducted online. This move aims to reduce the carbon footprint and increase transparency."
        ]
      },
      {
        "tag": "contact_info",
        "patterns" :[
          "Can you provide general information about SASTRA College?",
          "Tell me about the location and campus of SASTRA College.",
          "What are the contact details for SASTRA College?",
          "Is there an official website for SASTRA College?",
          "Provide information about SASTRA College, including its address and phone number."
      ],
            "responses": [
          "   Deemed University is located in Thanjavur, Tamil Nadu, with an address at Thanjavur 613 401. For more details, contact the General Admission Helpdesk at +91 4362 350011-15 or visit the official website at www.sastra.edu."
        ]
      },
      {
        "tag": "ranklist_info",
        "patterns": ["ranklist","rank details"],
        "responses": [
          "The rank list for admission will be released on June 24, 2023, and will be available at www.sastra.edu. Admissions will commence from June 26, 2023, based on the results. Any changes in dates will be notified on the website."
        ]
      },
      {
        "tag": "no_jee_written",
        "patterns" : [
          "How is the combined score calculated without JEE (Main)?",
          "What are the details for admission without JEE score at SASTRA College?",
          "Can I still get admission if I haven't written JEE (Main)?",
          "Tell me about the admission process for candidates who haven't taken JEE Main.",
          "What is the weighted score calculation for Stream 1 without JEE (Main)?",
          "Are there any alternative criteria for admission if I didn't write JEE (Main)?",
          "Can I apply to both Stream 1 and Stream 2 without JEE (Main) scores?",
          "What weightage is given to Class XII marks if JEE (Main) is not taken?",
          "If I haven't written JEE (Main), how does it affect my chances of admission?",
          "Is there any flexibility for candidates who didn't appear for JEE (Main) in the admission process?"
      ],      
        "responses": [
          "If you haven't written JEE (Main), the weighted score for Stream 1 will be 0, but the +2 aggregate will be given 50% weightage. For Stream 2, the weightage for +2 marks will be 100%. You'll be considered in both Stream 1 & Stream 2 by default."
        ]
      },
      {
        "tag": "nacc_ranking",
        "patterns": ["What is the ranking of SASTRA College in India?",
        "Tell me about the NAAC rating for SASTRA College.",
        "Can you provide information about the overall ranking of SASTRA College?",
        "Where does SASTRA College stand in the national college rankings?",
        "Provide details on the NAAC rating and overall rank of SASTRA College."],
        "responses": [
          "According to NAAC, sastra   University has been rated as an A++ university in India with a score of 3.76/4.00."
        ]
      },
      {
        "tag": "fee_details",
        "patterns": ["What is the fee for LLB at SASTRA College?",
          "Can you provide fee details for B.Tech at SASTRA College?",
          "Tell me about the fee information for M.Tech at SASTRA College.",
          "Provide details on the fee structure for different courses at SASTRA College.",
          "What is the fee range for B.A LLB, B.Tech, and M.Tech at SASTRA College?"
      ],
        "responses": [
          "B.A LLB fee is 7 Lakh, B.Tech fee ranges from 4.7 L to 7.7 L, and M.Tech fee varies from 2.8 L to 7.7 L."
        ]
      },
      {
        "tag": "branch_admissions",
        "patterns": ["how can i get a admission in CSE or cse or ece or eee or it or mechanical or civil or bio technology or bio engnieering?","How can I get a seat in the Computer Science and Engineering (CSE) branch at SASTRA College?",
        "Tell me about the admission process for the Electronics and Communication Engineering (ECE) branch.",
        "What is the admission procedure for the Mechanical Engineering branch at SASTRA College?",
        "Can you provide details on how to secure admission in the Information Technology (IT) branch?",
        "What are the requirements for getting admission in the Electrical Engineering (EE) branch?",
        "Is there a specific rank or score required for admission to the Civil Engineering branch?",
        "Tell me about the eligibility criteria for the Chemical Engineering branch at SASTRA College.",
        "How are seats allocated in the Computer Science and Engineering (CSE) branch?",
        "Are there any specific entrance exams for admission to the Biotechnology branch?",
        "What factors are considered for branch allocation during the admission process?",
        "Can you provide information on the admission process for the Aerospace Engineering branch?",
        "Tell me about the eligibility criteria for the Environmental Engineering branch at SASTRA College.",
        "How can I secure admission in the Computer Science and Business Systems branch?",
        "What are the requirements for admission to the Artificial Intelligence and Machine Learning branch?",
        "Tell me about the admission procedure for the Robotics and Automation Engineering branch at SASTRA College."],
        "responses": [
          "Admissions to specific branches are based on the rank list. Your branch allocation depends on your rank in the admission process."
        ]
      },
      {
        "tag": "visit_campus",
        "patterns": ["Can I visit the campus of SASTRA College?",
        "What is the procedure for visiting SASTRA College's campus?",
        "Tell me about the visitation policy for SASTRA College's campus.",
        "Are there specific visiting hours for the campus of SASTRA College?",
        "Can you provide information on the best time to visit the campus of SASTRA College?"],
        "responses": [
          "You can visit the campus anytime, except during night hours. It's recommended to plan your visit during regular hours for a better experience."
        ]
      },
      {
        "tag": "alumni_connections",
        "patterns": ["connect with alumni ", "Alumni details","aluminis","alimini"],
        "responses": [
          "Details of alumni are available on the    website at https://www.  .edu/. You can find contact information and connect with alumni through the provided channels."
        ]
      },
      {
        "tag": "branch_sliding",
        "patterns": ["How can I slide to other branches or departments at SASTRA College?",
        "Tell me about the branch sliding process at SASTRA College.",
        "What are the criteria for branch sliding in the first year?",
        "Can you provide details on the eligibility for branch sliding?",
        "How does the branch sliding process work at SASTRA College?","slide to other branches or departments ", "Branch sliding process","sliding process","branch sliding"],
        "responses": [
          "Branch sliding is based on your academic performance in the first year. Specific criteria are applied for sliding, and it depends on the availability of seats in the desired branch."
        ]
      },
      {
        "tag": "admission_fee",
        "patterns": ["What is the admission fee at SASTRA College?",
        "Can you provide details about the admission fee structure?",
        "Tell me about the fees for admission at SASTRA College.",
        "What is the approximate amount for the admission fee?",
        "Provide information on how to pay the admission fee at SASTRA College."],
        "responses": [
          "The admission fee is approximately 600-700 rupees."
        ]
      },
      {
        "tag": "campus_area",
        "patterns" : [
          "How much area does the college campus cover?",
          "Tell me about the total land area of SASTRA College.",
          "What is the size of the campus at SASTRA College?",
          "Provide information on the area covered by the college premises.",
          "Can you share details about the campus size and layout at SASTRA College?"
      ],
        "responses": [
          "The college is spread across approximately 200 acres."
        ]
      }

]
}